zevorn/8051-ell/libraries/peripherals/STC8x/inc/STC8x_PCA.h
/*-----------------------------------------------------------------------
|                            FILE DESCRIPTION                           |
-----------------------------------------------------------------------*/
/*----------------------------------------------------------------------
  - File name     : STC8x_PCA.h
  - Author        : zeweni
  - Update date   : 2020.02.06
  -	Copyright(C)  : 2020-2021 zeweni. All rights reserved.
-----------------------------------------------------------------------*/
/*------------------------------------------------------------------------
|                            COPYRIGHT NOTICE                            |
------------------------------------------------------------------------*/
/*
 * Copyright (C) 2021, zeweni (17870070675@163.com)

 * This file is part of 8051 ELL low-layer libraries.

 * 8051 ELL low-layer libraries is free software: you can redistribute 
 * it and/or modify it under the terms of the Apache-2.0 License.

 * 8051 ELL low-layer libraries is distributed in the hope that it will 
 * be useful,but WITHOUT ANY WARRANTY; without even the implied warranty 
 * of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
 * Apache-2.0 License License for more details.

 * You should have received a copy of the Apache-2.0 License.8051 ELL 
 * low-layer libraries. If not, see <http://www.apache.org/licenses/>.
**/
/*-----------------------------------------------------------------------
|                               INCLUDES                                |
-----------------------------------------------------------------------*/
#ifndef __STC8x_PCA_H_
#define __STC8x_PCA_H_

#include "Lib_CFG.h"

/** 如果没有定义这个宏，默认为STC8Ax。
    If the mirco is undefined，select to STC8Ax */
#ifndef PER_LIB_MCU_MUODEL   
    #define PER_LIB_MCU_MUODEL STC8Ax
#endif

/** 如果没有定义这个宏，默认为1。
    If the mirco is undefined，select to "1" */
#ifndef PER_LIB_PCA_CTRL
    #define PER_LIB_PCA_CTRL 1
#endif

/** 如果没有定义这个宏，默认为1。
    If the mirco is undefined，select to "1" */
#ifndef PER_LIB_PCA_INIT_CTRL
    #define PER_LIB_PCA_INIT_CTRL 1
#endif

/** 如果没有定义这个宏，默认为1。
    If the mirco is undefined，select to "1" */
#ifndef PER_LIB_PCA_NVIC_CTRL
    #define PER_LIB_PCA_NVIC_CTRL 1
#endif

/** 如果没有定义这个宏，默认为1。
    If the mirco is undefined，select to "1" */
#ifndef PER_LIB_PCA_WORK_CTRL
    #define PER_LIB_PCA_WORK_CTRL 1
#endif


#if    (PER_LIB_MCU_MUODEL == STC8Ax)
    #include "STC8Ax_REG.h"  
#elif  (PER_LIB_MCU_MUODEL == STC8Cx)
    #include "STC8Cx_REG.h"
#elif  (PER_LIB_MCU_MUODEL == STC8Fx)
    #include "STC8Fx_REG.h"
#elif  (PER_LIB_MCU_MUODEL == STC8Gx)
    #include "STC8Gx_REG.h"
#elif  (PER_LIB_MCU_MUODEL == STC8Hx)
    #include "STC8Hx_REG.h"
#endif
/*--------------------------------------------------------
| @Description: STC8x core                               |
--------------------------------------------------------*/
#include "ELL_CORE.h"

/*-----------------------------------------------------------------------
|                                 DATA                                  |
-----------------------------------------------------------------------*/

/** 
 * @brief	 PCA工作类型枚举体
 * @details	 PCA type control enumenumeration.
**/
typedef enum
{
	PCA_TYPE_CAP = 0X00,   /*!< PAC工作在捕获模式。PAC works in capture mode. */
	PCA_TYPE_PWM = 0x42,   /*!< PAC工作在PWM模式。PAC works in PWM mode. */
	PCA_TYPE_TIM = 0x48,   /*!< PAC工作在定时器模式。PAC works in timer mode. */
	PCA_TYPE_POP = 0x4C    /*!< PAC工作在脉冲输出模式。PAC works in pulse output mode. */
} PCAType_Type;


/** 
 * @brief	 PCA做CAP时，触发模式枚举体。
 * @details	 CAP trigger mode enumenumeration.
**/
typedef enum
{
	PCA_CAP_Mode_Falling = 0x01, /*!< �½��ز���Capture on falling edge.*/
	PCA_CAP_Mode_Rising  = 0X02, /*!< �����ز���Rising edge capture. */
	PCA_CAP_Mode_Edge    = 0x03  /*!< ���ز���Edge capture. */
} PCA_CAPMode_Type;


/** 
 * @brief	 PCA时钟源枚举体
 * @details	 PCA working clock enumeration body.
**/
typedef enum
{
	PCA_SCLK_DIV_12 = 0x00,   /*!< 系统时钟12分频。System clock / 12. */
	PCA_SCLK_DIV_2  = 0x02,   /*!< 系统时钟2分频。System clock / 2. */
	PCA_TIMER0	    = 0x04,   /*!< 定时器0溢出频率。Overflow pulse of timer 0.*/
	PCA_ECI         = 0x06,   /*!< 外部时钟源。External input clock of ECI pin. */
	PCA_SCLK_DIV_1	= 0x08,   /*!< 系统时钟1分频。System clock / 1. */
	PCA_SCLK_DIV_4  = 0x0A,   /*!< 系统时钟4分频。System clock / 4. */
	PCA_SCLK_DIV_6  = 0x0C,   /*!< 系统时钟6分频。System clock / 6. */
	PCA_SCLK_DIV_8  = 0x0E    /*!< 系统时钟8分频。System clock / 8.*/
} PCACLKSrc_Type;


/** 
 * @brief	 PCA做PWM时，分辨率枚举体。
 * @details	 PCA PWM bits mode enumenumeration.
**/
typedef enum
{
	PCA_PWM_8Bits   = 0x00,  /*!< 8-bit PCA_PWM mode. */
	PCA_PWM_7Bits   = 0x01,	 /*!< 7-bit PCA_PWM mode. */
	PCA_PWM_6Bits   = 0x02,	 /*!< 6-bit PCA_PWM mode. */
	PCA_PWM_10Bits  = 0x03	 /*!< 10-bit PCA_PWM mode.*/
} PCA_PWMBits_Type;


/** 
 * @brief	 PCA做CAP时，触发中断方式枚举体。
 * @details	 PCA CAP interrupt trigger enumenumeration.
**/
typedef enum
{
	PCA_CAPTri_Null    = 0x00,   /*!< 无触发模式，不使能中断。
									No trigger mode, no interrupt is enabled. */
	PCA_CAPTri_Falling = 0x10,   /*!< 下降沿触发模式，使能中断。
									Falling edge trigger mode, enable interrupt. */
	PCA_CAPTri_Rising  = 0x20,   /*!< 上升沿触发模式，使能中断。
									The rising edge trigger mode enables interrupts. */
	PCA_CAPTri_Edge    = 0x30    /*!< 边沿触发模式，使能中断。
									Edge trigger mode, enable interrupt.*/
} PCA_CAPTri_Type;

/*-----------------------------------------------------------------------
|                             API FUNCTION                              |
-----------------------------------------------------------------------*/

#if ( PER_LIB_PCA_CTRL == 1)

	#if (PER_LIB_MCU_MUODEL == STC8Ax || PER_LIB_MCU_MUODEL == STC8Gx)

		#if ( PER_LIB_PCA_INIT_CTRL == 1)


			/**
			 * @brief     PCA计数器初始化,必须放在所有PCA函数的后面。
			 * @details   PCA counter init function,It must be initialized last.
			 * @param[in] clkSrc
			 * @param[in] run 使能控制位.enable control.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA_CNT_Init(PCACLKSrc_Type clkSrc,BOOL run);


			/**
			 * @brief     PCA0做PWM初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA0 PWM init function,it must first is initialized.
			 * @param[in] pwmBits   PWM分辨率。PWM accuracy of bits.
			 * @param[in] duty      PWM占空比。PWM duty.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA0_PWM_Init(PCA_PWMBits_Type pwmBits,uint16_t  duty);
			
			
			/**
			 * @brief     PCA1做PWM初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA1 PWM init function,it must first is initialized.
			 * @param[in] pwmBits   PWM分辨率。PWM accuracy of bits.
			 * @param[in] duty      PWM占空比。PWM duty.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA1_PWM_Init(PCA_PWMBits_Type pwmBits,uint16_t  duty);


			/**
			 * @brief     PCA2做PWM初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA2 PWM init function,it must first is initialized.
			 * @param[in] pwmBits   PWM分辨率。PWM accuracy of bits.
			 * @param[in] duty      PWM占空比。PWM duty.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA2_PWM_Init(PCA_PWMBits_Type pwmBits,uint16_t  duty);


