zevorn/8051-ell/libraries/peripherals/STC8x/inc/STC8x_PCA.h
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     PCA3做PWM初始化,必须放在PCA计数器初始化之前。
				 * @details   PCA3 PWM init function,it must first is initialized.
				 * @param[in] pwmBits   PWM分辨率。PWM accuracy of bits.
				 * @param[in] duty      PWM占空比。PWM duty.
				 * @return    FSC_SUCCESS 返回成功。Return to success.
				 * @return    FSC_FAIL    返回失败。Return to fail.
				**/
				FSCSTATE PCA3_PWM_Init(PCA_PWMBits_Type pwmBits,uint16_t  duty);
				
			#endif

			
			/**
			 * @brief     PCA0做CAP初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA0 CAP init function,it must first is initialized.
			 * @param[in] mode  捕获模式。Capture mode.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA0_CAP_Init(PCA_CAPMode_Type mode);
			
			
			/**
			 * @brief     PCA1做CAP初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA1 CAP init function,it must first is initialized.
			 * @param[in] mode  捕获模式。Capture mode.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA1_CAP_Init(PCA_CAPMode_Type mode);
			
			
			/**
			 * @brief     PCA2做CAP初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA2 CAP init function,it must first is initialized.
			 * @param[in] mode  捕获模式。Capture mode.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA2_CAP_Init(PCA_CAPMode_Type mode);


			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
			
				/**
				 * @brief     PCA3做CAP初始化,必须放在PCA计数器初始化之前。
				 * @details   PCA3 CAP init function,it must first is initialized.
				 * @param[in] mode  捕获模式。Capture mode.
				 * @return    FSC_SUCCESS 返回成功。Return to success.
				 * @return    FSC_FAIL    返回失败。Return to fail.
				**/			
				FSCSTATE PCA3_CAP_Init(PCA_CAPMode_Type mode);
				
			#endif


			/**
			 * @brief     PCA0做TIMER初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA0 TIMER init function,it must first is initialized.
			 * @param[in] time  定时时间。Timing.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA0_TIM_Init(uint16_t time);
			
			
			/**
			 * @brief     PCA1做TIMER初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA1 TIMER init function,it must first is initialized.
			 * @param[in] time  定时时间。Timing.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA1_TIM_Init(uint16_t time);
			
			
			/**
			 * @brief     PCA2做TIMER初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA2 TIMER init function,it must first is initialized.
			 * @param[in] time  定时时间。Timing.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA2_TIM_Init(uint16_t time);


			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     PCA3做TIMER初始化,必须放在PCA计数器初始化之前。
				 * @details   PCA3 TIMER init function,it must first is initialized.
				 * @param[in] time  定时时间。Timing.
				 * @return    FSC_SUCCESS 返回成功。Return to success.
				 * @return    FSC_FAIL    返回失败。Return to fail.
				**/
				FSCSTATE PCA3_TIM_Init(uint16_t time);
				
			#endif


			/**
			 * @brief     PCA0做POP初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA0 POP init function,it must first is initialized.
			 * @param[in] fre  脉冲输出频率。Output frequency.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA0_POP_Init(uint16_t fre);
			
			
			/**
			 * @brief     PCA1做POP初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA1 POP init function,it must first is initialized.
			 * @param[in] fre  脉冲输出频率。Output frequency.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA1_POP_Init(uint16_t fre);
			
			
			/**
			 * @brief     PCA2做POP初始化,必须放在PCA计数器初始化之前。
			 * @details   PCA2 POP init function,it must first is initialized.
			 * @param[in] fre  脉冲输出频率。Output frequency.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE PCA2_POP_Init(uint16_t fre);


			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     PCA3做POP初始化,必须放在PCA计数器初始化之前。
				 * @details   PCA3 POP init function,it must first is initialized.
				 * @param[in] fre  脉冲输出频率。Output frequency.
				 * @return    FSC_SUCCESS 返回成功。Return to success.
				 * @return    FSC_FAIL    返回失败。Return to fail.
				**/
				FSCSTATE PCA3_POP_Init(uint16_t fre);
				
			#endif
			
		#endif
		
		
		#if ( PER_LIB_PCA_WORK_CTRL == 1 )
		
			/**
			 * @brief     PCA0做TIMER或POP时，重载载计数器。
			 * @details   PCA0 TIM and POP reload value function.
			 * @param[in] None.
			 * @return    None.
			**/
			void PCA0_TIM_POP_ReValue(void);
			
			
			/**
			 * @brief     PCA1做TIMER或POP时，重载载计数器。
			 * @details   PCA1 TIM and POP reload value function.
			 * @param[in] None.
			 * @return    None.
			**/
			void PCA1_TIM_POP_ReValue(void);
			
			
			/**
			 * @brief     PCA2做TIMER或POP时，重载载计数器。
			 * @details   PCA2 TIM and POP reload value function.
			 * @param[in] None.
			 * @return    None.
			**/
			void PCA2_TIM_POP_ReValue(void);


			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     PCA3做TIMER或POP时，重载载计数器。
				 * @details   PCA3 TIM and POP reload value function.
				 * @param[in] None.
				 * @return    None.
				**/
				void PCA3_TIM_POP_ReValue(void);
				
			#endif
				
				
			/**
			 * @brief     PCA0停止工作宏函数。
			 * @details   PCA0 stops working macro function. 
			**/
			#define    PCA0_WORK_STOP()   do{CCAPM0 = 0;}while(0)
			
			
			/**
			 * @brief     PCA1停止工作宏函数。
			 * @details   PCA1 stops working macro function. 
			**/
			#define    PCA1_WORK_STOP()   do{CCAPM1 = 0;}while(0)
			
			
			/**
			 * @brief     PCA2停止工作宏函数。
			 * @details   PCA2 stops working macro function. 
			**/
			#define    PCA2_WORK_STOP()   do{CCAPM2 = 0;}while(0)	
			
			
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     PCA3停止工作宏函数。
				 * @details   PCA3 stops working macro function. 
				**/
				#define    PCA3_WORK_STOP()   do{CCAPM3 = 0;}while(0)	
			
			#endif

				
			/**
			 * @brief     PCA0做6位PWM时，占空比调节宏函数。
			 * @details   When PCA0 is used as 6-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA0_PWM_6BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM0 = PCA_TYPE_PWM;                                \
				PCA_PWM0 = (PCA_PWM0 & 0x3F)|(0x02 << 6);             \
				PCA_PWM0 = (PCA_PWM0 & 0XFE) | ((duty & 0x40) >> 6);  \
				PCA_PWM0 = (PCA_PWM0 & 0XFD) | ((duty & 0x40) >> 5);  \
				CCAP0L = (uint8_t)(duty & 0x003F);                   \
				CCAP0H = (uint8_t)(duty & 0x003F);                   \
			}while(0)
			
			
			/**
			 * @brief     PCA0做7位PWM时，占空比调节宏函数。
			 * @details   When PCA0 is used as 7-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA0_PWM_7BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM0 = PCA_TYPE_PWM;                                \
				PCA_PWM0 = (PCA_PWM0 & 0x3F)|(0x01 << 6);             \
				PCA_PWM0 = (PCA_PWM0 & 0XFE) | ((duty & 0x80) >> 7);  \
				PCA_PWM0 = (PCA_PWM0 & 0XFD) | ((duty & 0x80) >> 6);  \
				CCAP0L = (uint8_t)(duty & 0x007F);                   \
				CCAP0H = (uint8_t)(duty & 0x007F);                   \
			}while(0)
			
			
			/**
			 * @brief     PCA0做8位PWM时，占空比调节宏函数。
			 * @details   When PCA0 is used as 8-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA0_PWM_8BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM0 = PCA_TYPE_PWM;                                \
				PCA_PWM0 = (PCA_PWM0 & 0x3F)|(0x00 << 6);             \
				PCA_PWM0 = (PCA_PWM0 & 0XFE) | ((duty & 0x100) >> 8); \
				PCA_PWM0 = (PCA_PWM0 & 0XFD) | ((duty & 0x100) >> 7); \
				CCAP0L = (uint8_t)duty;                              \
				CCAP0H = (uint8_t)duty;                              \
			}while(0)
			
			
			/**
			 * @brief     PCA0做10位PWM时，占空比调节宏函数。
			 * @details   When PCA0 is used as 10-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA0_PWM_10BITS_CTRL(duty)                         \
			do{                                                        \
				CCAPM0 = PCA_TYPE_PWM;                                 \
				PCA_PWM0 = (PCA_PWM0 & 0x3F)|(0x03 << 6);              \
				PCA_PWM0 = (PCA_PWM0 & 0XFE) | ((duty & 0x400) >> 10); \
				PCA_PWM0 = (PCA_PWM0 & 0XFD) | ((duty & 0x400) >> 9);  \
				PCA_PWM0 = (PCA_PWM0 & 0XF3) | ((duty & 0x300) >> 6);  \
				PCA_PWM0 = (PCA_PWM0 & 0XCF) | ((duty & 0x300) >> 4);  \
				CCAP0L = (uint8_t)duty;                               \
				CCAP0H = (uint8_t)duty;                               \
			} while (0)
	
			
			/**
			 * @brief     PCA1做6位PWM时，占空比调节宏函数。
			 * @details   When PCA1 is used as 6-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA1_PWM_6BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM1 = PCA_TYPE_PWM;                                \
				PCA_PWM1 = (PCA_PWM1 & 0x3F)|(0x02 << 6);             \
				PCA_PWM1 = (PCA_PWM1 & 0XFE) | ((duty & 0x40) >> 6);  \
				PCA_PWM1 = (PCA_PWM1 & 0XFD) | ((duty & 0x40) >> 5);  \
				CCAP1L = (uint8_t)(duty & 0x003F);                   \
				CCAP1H = (uint8_t)(duty & 0x003F);                   \
			}while(0)
			
			
			/**
			 * @brief     PCA1做7位PWM时，占空比调节宏函数。
			 * @details   When PCA1 is used as 7-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA1_PWM_7BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM1 = PCA_TYPE_PWM;                                \
				PCA_PWM1 = (PCA_PWM1 & 0x3F)|(0x01 << 6);             \
				PCA_PWM1 = (PCA_PWM1 & 0XFE) | ((duty & 0x80) >> 7);  \
				PCA_PWM1 = (PCA_PWM1 & 0XFD) | ((duty & 0x80) >> 6);  \
				CCAP1L = (uint8_t)(duty & 0x007F);                   \
				CCAP1H = (uint8_t)(duty & 0x007F);                   \
			}while(0)
			
			
			/**
			 * @brief     PCA1做8位PWM时，占空比调节宏函数。
			 * @details   When PCA1 is used as 8-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA1_PWM_8BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM1 = PCA_TYPE_PWM;                                \
				PCA_PWM1 = (PCA_PWM1 & 0x3F)|(0x00 << 6);             \
				PCA_PWM1 = (PCA_PWM1 & 0XFE) | ((duty & 0x100) >> 8); \
				PCA_PWM1 = (PCA_PWM1 & 0XFD) | ((duty & 0x100) >> 7); \
				CCAP1L = (uint8_t)duty;                              \
				CCAP1H = (uint8_t)duty;                              \
			}while(0)
			
			
			/**
			 * @brief     PCA1做10位PWM时，占空比调节宏函数。
			 * @details   When PCA1 is used as 10-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA1_PWM_10BITS_CTRL(duty)                         \
			do{                                                        \
				CCAPM1 = PCA_TYPE_PWM;                                 \
				PCA_PWM1 = (PCA_PWM1 & 0x3F)|(0x03 << 6);              \
				PCA_PWM1 = (PCA_PWM1 & 0XFE) | ((duty & 0x400) >> 10); \
				PCA_PWM1 = (PCA_PWM1 & 0XFD) | ((duty & 0x400) >> 9);  \
				PCA_PWM1 = (PCA_PWM1 & 0XF3) | ((duty & 0x300) >> 6);  \
				PCA_PWM1 = (PCA_PWM1 & 0XCF) | ((duty & 0x300) >> 4);  \
				CCAP1L = (uint8_t)duty;                               \
				CCAP1H = (uint8_t)duty;                               \
			}while(0)
			
			
			/**
			 * @brief     PCA2做6位PWM时，占空比调节宏函数。
			 * @details   When PCA2 is used as 6-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA2_PWM_6BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM2 = PCA_TYPE_PWM;                                \
				PCA_PWM2 = (PCA_PWM2 & 0x3F)|(0x02 << 6);             \
				PCA_PWM2 = (PCA_PWM2 & 0XFE) | ((duty & 0x40) >> 6);  \
				PCA_PWM2 = (PCA_PWM2 & 0XFD) | ((duty & 0x40) >> 5);  \
				CCAP2L = (uint8_t)(duty & 0x003F);                   \
				CCAP2H = (uint8_t)(duty & 0x003F);                   \
			}while(0)
			
			
			/**
			 * @brief     PCA2做7位PWM时，占空比调节宏函数。
			 * @details   When PCA2 is used as 7-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA2_PWM_7BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM2 = PCA_TYPE_PWM;                                \
				PCA_PWM2 = (PCA_PWM2 & 0x3F)|(0x01 << 6);             \
				PCA_PWM2 = (PCA_PWM2 & 0XFE) | ((duty & 0x80) >> 7);  \
				PCA_PWM2 = (PCA_PWM2 & 0XFD) | ((duty & 0x80) >> 6);  \
				CCAP2L = (uint8_t)(duty & 0x007F);                   \
				CCAP2H = (uint8_t)(duty & 0x007F);                   \
			}while(0)
			
			
			/**
			 * @brief     PCA2做8位PWM时，占空比调节宏函数。
			 * @details   When PCA2 is used as 8-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA2_PWM_8BITS_CTRL(duty)                         \
			do{                                                       \
				CCAPM2 = PCA_TYPE_PWM;                                \
				PCA_PWM2 = (PCA_PWM2 & 0x3F)|(0x00 << 6);             \
				PCA_PWM2 = (PCA_PWM2 & 0XFE) | ((duty & 0x100) >> 8); \
				PCA_PWM2 = (PCA_PWM2 & 0XFD) | ((duty & 0x100) >> 7); \
				CCAP2L = (uint8_t)duty;                              \
				CCAP2H = (uint8_t)duty;                              \
			}while(0)
			
			
			/**
			 * @brief     PCA2做10位PWM时，占空比调节宏函数。
			 * @details   When PCA2 is used as 10-bit precision PWM, 
			 *            set the duty cycle macro function.
			 * @param[in] duty 占空比。PWM duty.
			**/
			#define PCA2_PWM_10BITS_CTRL(duty)                         \
			do{                                                        \
				CCAPM2 = PCA_TYPE_PWM;                                 \
				PCA_PWM2 = (PCA_PWM2 & 0x3F)|(0x03 << 6);              \
				PCA_PWM2 = (PCA_PWM2 & 0XFE) | ((duty & 0x400) >> 10); \
				PCA_PWM2 = (PCA_PWM2 & 0XFD) | ((duty & 0x400) >> 9);  \
				PCA_PWM2 = (PCA_PWM2 & 0XF3) | ((duty & 0x300) >> 6);  \
				PCA_PWM2 = (PCA_PWM2 & 0XCF) | ((duty & 0x300) >> 4);  \
				CCAP2L = (uint8_t)duty;                               \
				CCAP2H = (uint8_t)duty;                               \
			}while(0)

			
