zevorn/8051-ell/libraries/peripherals/STC8x/inc/STC8x_PCA.h
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     PCA3做6位PWM时，占空比调节宏函数。
				 * @details   When PCA3 is used as 6-bit precision PWM, 
				 *            set the duty cycle macro function.
				 * @param[in] duty 占空比。PWM duty.
				**/
				#define PCA3_PWM_6BITS_CTRL(duty)                         \
				do{                                                       \
					CCAPM3 = PCA_TYPE_PWM;                                \
					PCA_PWM3 = (PCA_PWM3 & 0x3F)|(0x02 << 6);             \
					PCA_PWM3 = (PCA_PWM3 & 0XFE) | ((duty & 0x40) >> 6);  \
					PCA_PWM3 = (PCA_PWM3 & 0XFD) | ((duty & 0x40) >> 5);  \
					CCAP3L = (uint8_t)(duty & 0x003F);                   \
					CCAP3H = (uint8_t)(duty & 0x003F);                   \
				}while(0)
				
				
				/**
				 * @brief     PCA3做7位PWM时，占空比调节宏函数。
				 * @details   When PCA3 is used as 7-bit precision PWM, 
				 *            set the duty cycle macro function.
				 * @param[in] duty 占空比。PWM duty.
				**/
				#define PCA3_PWM_7BITS_CTRL(duty)                         \
				do{                                                       \
					CCAPM3 = PCA_TYPE_PWM;                                \
					PCA_PWM3 = (PCA_PWM3 & 0x3F)|(0x01 << 6);             \
					PCA_PWM3 = (PCA_PWM3 & 0XFE) | ((duty & 0x80) >> 7);  \
					PCA_PWM3 = (PCA_PWM3 & 0XFD) | ((duty & 0x80) >> 6);  \
					CCAP3L = (uint8_t)(duty & 0x007F);                   \
					CCAP3H = (uint8_t)(duty & 0x007F);                   \
				}while(0)
				
				
				/**
				 * @brief     PCA3做8位PWM时，占空比调节宏函数。
				 * @details   When PCA3 is used as 8-bit precision PWM, 
				 *            set the duty cycle macro function.
				 * @param[in] duty 占空比。PWM duty.
				**/
				#define PCA3_PWM_8BITS_CTRL(duty)                          \
				do{                                                        \
					CCAPM3 = PCA_TYPE_PWM;                                 \
					PCA_PWM3 = (PCA_PWM3 & 0x3F)|(0x00 << 6);              \
					PCA_PWM3 = (PCA_PWM3 & 0XFE) | ((duty & 0x100) >> 8);  \
					PCA_PWM3 = (PCA_PWM3 & 0XFD) | ((duty & 0x100) >> 7);  \
					CCAP3L = (uint8_t)duty;                               \
					CCAP3H = (uint8_t)duty;                               \
				}while(0)
				
				
				/**
				 * @brief     PCA3做10位PWM时，占空比调节宏函数。
				 * @details   When PCA3 is used as 10-bit precision PWM, 
				 *            set the duty cycle macro function.
				 * @param[in] duty 占空比。PWM duty.
				**/
				#define PCA3_PWM_10BITS_CTRL(duty)                         \
				do{                                                        \
					CCAPM3 = PCA_TYPE_PWM;                                 \
					PCA_PWM3 = (PCA_PWM3 & 0x3F)|(0x03 << 6);              \
					PCA_PWM3 = (PCA_PWM3 & 0XFE) | ((duty & 0x400) >> 10); \
					PCA_PWM3 = (PCA_PWM3 & 0XFD) | ((duty & 0x400) >> 9);  \
					PCA_PWM3 = (PCA_PWM3 & 0XF3) | ((duty & 0x300) >> 6);  \
					PCA_PWM3 = (PCA_PWM3 & 0XCF) | ((duty & 0x300) >> 4);  \
					CCAP3L = (uint8_t)duty;                               \
					CCAP3H = (uint8_t)duty;                               \
				}while(0)

			#endif
			
				
			/**
			 * @brief     PCA切换复用IO函数。
			 * @details   PCA switch out port control function.  
			 * @param[in] port 复用IO枚举体。IO switch enumerator.
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE GPIO_PCA_SWPort(GPIOSWPort_Type port);
				
		#endif
				
		#if ( PER_LIB_PCA_INIT_CTRL == 1)		

			/**
			 * @brief     PCA计数器中断初始化函数。
			 * @details   PCA Counter NVIC function.   
			 * @param[in] pri 中断优先级。interrupt priority.
			 * @param[in] run 使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA_CNT_Init(NVICPri_Type pri,BOOL run);


			/**
			 * @brief     PCA0做TIMER或POP中断初始化函数。
			 * @details   PCA0 Timer and POP NVIC function .  
			 * @param[in] run 使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA0_TIM_POP_Init(BOOL run);
			
			
			/**
			 * @brief     PCA1做TIMER或POP中断初始化函数。
			 * @details   PCA1 Timer and POP NVIC function .  
			 * @param[in] run 使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA1_TIM_POP_Init(BOOL run);
			
			
			/**
			 * @brief     PCA2做TIMER或POP中断初始化函数。
			 * @details   PCA2 Timer and POP NVIC function .  
			 * @param[in] run 使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA2_TIM_POP_Init(BOOL run);


			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
			
				/**
				 * @brief     PCA3做TIMER或POP中断初始化函数。
				 * @details   PCA3 Timer and POP NVIC function .  
				 * @param[in] run 使能控制位。enable control. 
				 * @return    FSC_SUCCESS 返回成功。Return to success.
				 * @return    FSC_FAIL    返回失败。Return to fail.
				**/
				FSCSTATE NVIC_PCA3_TIM_POP_Init(BOOL run);
				
			#endif
			
			/**
			 * @brief     PCA0做PWM或CAP中断初始化函数。
			 * @details   PCA0 PWM and CAP NVIC function.  
			 * @param[in] triMode  触发模式。 Interrupt trigger mode. 
			 * @param[in] run      使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA0_PWM_CAP_Init(PCA_CAPTri_Type triMode,BOOL run);
			
			
			/**
			 * @brief     PCA1做PWM或CAP中断初始化函数。
			 * @details   PCA1 PWM and CAP NVIC function.  
			 * @param[in] triMode  触发模式。 Interrupt trigger mode. 
			 * @param[in] run      使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA1_PWM_CAP_Init(PCA_CAPTri_Type triMode,BOOL run);
			
			
			/**
			 * @brief     PCA2做PWM或CAP中断初始化函数。
			 * @details   PCA2 PWM and CAP NVIC function.  
			 * @param[in] triMode  触发模式。 Interrupt trigger mode. 
			 * @param[in] run      使能控制位。enable control. 
			 * @return    FSC_SUCCESS 返回成功。Return to success.
			 * @return    FSC_FAIL    返回失败。Return to fail.
			**/
			FSCSTATE NVIC_PCA2_PWM_CAP_Init(PCA_CAPTri_Type triMode,BOOL run);
			
			
			
