zevorn/8051-ell/libraries/peripherals/STC8x/inc/STC8x_PCA.h
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
			
				/**
				 * @brief     PCA3做PWM或CAP中断初始化函数。
				 * @details   PCA3 PWM and CAP NVIC function.  
				 * @param[in] triMode  触发模式。 Interrupt trigger mode. 
				 * @param[in] run      使能控制位。enable control. 
				 * @return    FSC_SUCCESS 返回成功。Return to success.
				 * @return    FSC_FAIL    返回失败。Return to fail.
				**/
				FSCSTATE NVIC_PCA3_PWM_CAP_Init(PCA_CAPTri_Type triMode,BOOL run);
				
			#endif
			
			/**
			 * @brief     获取PCA计数器溢出（中断）标志位。
			 * @details   Get the PCA counter overflow (interrupt) flag macro function.
			 * @return    [bit] 标志位。Flag.
			**/			
			#define PCA_CNT_GET_FLAG()      (CF)
			
			
			/**
			 * @brief     清除PCA计数器溢出（中断）标志位。
			 * @details   Clear the PCA counter overflow (interrupt) flag macro function.
			**/						
			#define PCA_CNT_CLEAR_FLAG()    do{CF = 0;}while(0)
			
			
			/**
			 * @brief     获取PCA0计数器溢出（中断）标志位。
			 * @details   Get the PCA0 overflow (interrupt) flag macro function.
			 * @return    [bit] 标志位。Flag.
			**/			
			#define PCA0_GET_FLAG()           (CCF0)
			
			
			/**
			 * @brief     获取PCA1计数器溢出（中断）标志位。
			 * @details   Get the PCA1 overflow (interrupt) flag macro function.
			 * @return    [bit] 标志位。Flag.
			**/			
			#define PCA1_GET_FLAG()           (CCF1)
			
			
			/**
			 * @brief     获取PCA2计数器溢出（中断）标志位。
			 * @details   Get the PCA2 overflow (interrupt) flag macro function.
			 * @return    [bit] 标志位。Flag.
			**/			
			#define PCA2_GET_FLAG()           (CCF2)
			
			
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
				/**
				 * @brief     获取PCA3计数器溢出（中断）标志位。
				 * @details   Get the PCA0 overflow (interrupt) flag macro function.
				 * @return    [bit] 标志位。Flag.
				**/			
				#define PCA3_GET_FLAG()           (CCF3)
				
			#endif
			
			/**
			 * @brief     清除PCA0计数器溢出（中断）标志位。
			 * @details   Clear the PCA0 overflow (interrupt) flag macro function.
			**/						
			#define PCA0_CLEAR_FLAG()     do{CCF0 = 0;}while(0)
			
			
			/**
			 * @brief     清除PCA1计数器溢出（中断）标志位。
			 * @details   Clear the PCA1 overflow (interrupt) flag macro function.
			**/			
			#define PCA1_CLEAR_FLAG()     do{CCF1 = 0;}while(0)
			
			
			/**
			 * @brief     清除PCA2计数器溢出（中断）标志位。
			 * @details   Clear the PCA2 overflow (interrupt) flag macro function.
			**/			
			#define PCA2_CLEAR_FLAG()     do{CCF2 = 0;}while(0)
			
			
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
			
				/**
				 * @brief     清除PCA3计数器溢出（中断）标志位。
				 * @details   Clear the PCA3 overflow (interrupt) flag macro function.
				**/			
				#define PCA3_CLEAR_FLAG()     do{CCF3 = 0;}while(0)
				
			#endif

            /**
             * @brief     PCA计数器中断控制宏函数。
             * @details   PCA interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA_CNT_CTRL(run)    \
			do{                                  \
				CMOD = (CMOD & 0xFE) | run;      \
			}while(0)
			
			
            /**
             * @brief     PCA0做TIM或POP中断控制宏函数。
             * @details   PCA0 TIM / POP interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA0_TIM_POP_CTRL(run)  \
			do{                                     \
				CCAPM0 = (CCAPM0 & 0xFE) | (run);   \
			}while(0)
			
			
            /**
             * @brief     PCA1做TIM或POP中断控制宏函数。
             * @details   PCA1 TIM / POP interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA1_TIM_POP_CTRL(run)   \
			do{                                      \
				CCAPM1 = (CCAPM0 & 0xFE) | (run);    \
			}while(0)
			
			
            /**
             * @brief     PCA2做TIM或POP中断控制宏函数。
             * @details   PCA2 TIM / POP interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA2_TIM_POP_CTRL(run)   \
			do{                                      \
				CCAPM2 = (CCAPM0 & 0xFE) | (run);    \
			}while(0)

			
			#if (PER_LIB_MCU_MUODEL == STC8Ax)
			
			
				/**
				 * @brief     PCA3做TIM或POP中断控制宏函数。
				 * @details   PCA3 TIM / POP interrupt switch control macro function.
				 * @param[in] run  使能控制位。Enable control bit.
				**/
				#define    NVIC_PCA3_TIM_POP_CTRL(run)   \
				do{                                      \
					CCAPM3 = (CCAPM0 & 0xFE) | (run);    \
				}while(0)
				
			#endif
				
				
            /**
             * @brief     PCA0做PWM或CAP中断控制宏函数。
             * @details   PCA0 PWM / CAPP interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA0_PWM_CAP_CTRL(run)     \
			do{                                        \
				CCAPM0 = (CCAPM0 & 0xFE) | (run);      \
			}while(0)
			
			
            /**
             * @brief     PCA1做PWM或CAP中断控制宏函数。
             * @details   PCA1 PWM / CAPP interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA1_PWM_CAP_CTRL(run)     \
			do{                                        \
				CCAPM1 = (CCAPM0 & 0xFE) | (run);      \
			}while(0)
			
			
            /**
             * @brief     PCA2做PWM或CAP中断控制宏函数。
             * @details   PCA2 PWM / CAPP interrupt switch control macro function.
             * @param[in] run  使能控制位。Enable control bit.
            **/
			#define    NVIC_PCA2_PWM_CAP_CTRL(run)     \
			do{                                        \
				CCAPM2 = (CCAPM0 & 0xFE) | (run);      \
			}while(0)

			
			#if (PER_LIB_MCU_MUODEL == STC8Ax)    
			
			
				/**
				 * @brief     PCA3做PWM或CAP中断控制宏函数。
				 * @details   PCA3 PWM / CAPP interrupt switch control macro function.
				 * @param[in] run  使能控制位。Enable control bit.
				**/
				#define    NVIC_PCA3_PWM_CAP_CTRL(run)    \
				do{										  \
					CCAPM3 = (CCAPM0 & 0xFE) | (run);     \
				}while(0)
				
			#endif


		#endif
		
	#endif

#endif
/*-----------------------------------------------------------------------
|                   END OF FLIE.  (C) COPYRIGHT zeweni                  |
-----------------------------------------------------------------------*/
#endif
